# Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c']
my_data = [10,20,30]

arr = np.array(my_data)
d = {'a': 10, 'b': 20, 'c': 30}

In [3]:
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [4]:
pd.Series( my_data, labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [6]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(data = [sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [8]:
series_1 = pd.Series([1,2,3,4], ['USA', 'Germany', 'USSR', 'Japan'])

In [9]:
series_1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [10]:
series_2 = pd.Series([1,2,5,4], ['USA', 'Germany', 'Italy', 'Japan'])

In [11]:
series_2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [12]:
series_1['USA']

1

# Dataframes

In [13]:
from numpy.random import randn

In [14]:
np.random.seed(101)

In [15]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [16]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [18]:
type(df['W'])

pandas.core.series.Series

In [19]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [20]:
df['new'] = df['W'] + df['Y']

In [21]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [22]:
df.drop('new', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [23]:
# to have the data stored not delete it permanently. 
# df.drop('new', axis=1, inplace=True)

In [24]:
df.loc['C']

W     -2.018168
X      0.740122
Y      0.528813
Z     -0.589001
new   -1.489355
Name: C, dtype: float64

In [25]:
df.iloc[2]

W     -2.018168
X      0.740122
Y      0.528813
Z     -0.589001
new   -1.489355
Name: C, dtype: float64

In [26]:
df.loc['B', 'Y']

-0.8480769834036315

In [27]:
df.loc[['A','B'], ['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318

## Conditional Selection

In [28]:
df > 0

       W      X      Y      Z    new
A   True   True   True   True   True
B   True  False  False   True  False
C  False   True   True  False  False
D   True  False  False   True  False
E   True   True   True   True   True

In [29]:
df[df > 0]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118       NaN       NaN  0.605965       NaN
C       NaN  0.740122  0.528813       NaN       NaN
D  0.188695       NaN       NaN  0.955057       NaN
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [30]:
df[df['W'] > 0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [31]:
df[df['W'] > 0][['Y', 'Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
D -0.933237  0.955057
E  2.605967  0.683509

In [33]:
df[(df['W'] > 0) & (df['Y'] > 1)]

          W         X         Y         Z       new
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [34]:
df.reset_index()

  index         W         X         Y         Z       new
0     A  2.706850  0.628133  0.907969  0.503826  3.614819
1     B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
2     C -2.018168  0.740122  0.528813 -0.589001 -1.489355
3     D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
4     E  0.190794  1.978757  2.605967  0.683509  2.796762

In [35]:
newindex = 'CA WC IN AU MC'.split()

In [36]:
newindex

['CA', 'WC', 'IN', 'AU', 'MC']

In [37]:
df['states'] = newindex

In [38]:
df

          W         X         Y         Z       new states
A  2.706850  0.628133  0.907969  0.503826  3.614819     CA
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959     WC
C -2.018168  0.740122  0.528813 -0.589001 -1.489355     IN
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542     AU
E  0.190794  1.978757  2.605967  0.683509  2.796762     MC

In [39]:
df.set_index('states')

               W         X         Y         Z       new
states
CA      2.706850  0.628133  0.907969  0.503826  3.614819
WC      0.651118 -0.319318 -0.848077  0.605965 -0.196959
IN     -2.018168  0.740122  0.528813 -0.589001 -1.489355
AU      0.188695 -0.758872 -0.933237  0.955057 -0.744542
MC      0.190794  1.978757  2.605967  0.683509  2.796762

In [47]:
df.drop('new', axis=1, inplace=True)

In [50]:
# df.set_index('states', inplace=True)

In [51]:
df

               W         X         Y         Z
states
CA      2.706850  0.628133  0.907969  0.503826
WC      0.651118 -0.319318 -0.848077  0.605965
IN     -2.018168  0.740122  0.528813 -0.589001
AU      0.188695 -0.758872 -0.933237  0.955057
MC      0.190794  1.978757  2.605967  0.683509

# Multi-index, and Multi-hierarchy

In [52]:
# import pandas as pd
# import numpy as np

In [53]:
# index levels

outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [54]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [55]:
inside

[1, 2, 3, 1, 2, 3]

In [56]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [57]:
df = pd.DataFrame(randn(6, 2), hier_index, ['A', 'B'])

In [58]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [59]:
df.index.names

FrozenList([None, None])

In [60]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [61]:
df.index.names = ['Groups', 'Numbers']

In [62]:
df

                       A         B
Groups Numbers
G1     1        0.302665  1.693723
       2       -1.706086 -1.159119
       3       -0.134841  0.390528
G2     1        0.166905  0.184502
       2        0.807706  0.072960
       3        0.638787  0.329646

In [65]:
df.loc['G2'].loc[2]

A    0.807706
B    0.072960
Name: 2, dtype: float64

In [67]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [66]:
df.xs # cross section of rows and column in multilevel index

<bound method NDFrame.xs of                        A         B
Groups Numbers
G1     1        0.302665  1.693723
       2       -1.706086 -1.159119
       3       -0.134841  0.390528
G2     1        0.166905  0.184502
       2        0.807706  0.072960
       3        0.638787  0.329646>

In [68]:
df.xs('G1')

                A         B
Numbers
1        0.302665  1.693723
2       -1.706086 -1.159119
3       -0.134841  0.390528

In [70]:
df.xs(1, level='Numbers')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

# Missing Data

In [72]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}

In [73]:
df = pd.DataFrame(d)

In [74]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [75]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [76]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [77]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [78]:
df.fillna(value='Fill Value')

            A           B  C
0         1.0         5.0  1
1         2.0  Fill Value  2
2  Fill Value  Fill Value  3

In [80]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# GroupBy

In [81]:
data = {
    'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'AAPL', 'AAPL'],
    'Person':['Vanessa', 'Mark', 'shanelle', 'Drew', 'Amy', 'Sarah'],
    'Sales':[200, 130, 120, 150, 234, 950]
}

In [82]:
df = pd.DataFrame(data)

In [83]:
df

  Company    Person  Sales
0    GOOG   Vanessa    200
1    GOOG      Mark    130
2    MSFT  shanelle    120
3    MSFT      Drew    150
4    AAPL       Amy    234
5    AAPL     Sarah    950

In [84]:
df.groupby('Company')

In [85]:
byComp = df.groupby('Company')

In [86]:
byComp.mean()

         Sales
Company
AAPL     592.0
GOOG     165.0
MSFT     135.0

In [87]:
byComp.sum()

         Sales
Company
AAPL      1184
GOOG       330
MSFT       270

In [88]:
byComp.std()

              Sales
Company
AAPL     506.288455
GOOG      49.497475
MSFT      21.213203

In [89]:
byComp.sum().loc['AAPL']

Sales    1184
Name: AAPL, dtype: int64

In [90]:
df.groupby('Company').sum().loc['AAPL']

Sales    1184
Name: AAPL, dtype: int64

In [91]:
byComp.max()

           Person  Sales
Company
AAPL        Sarah    950
GOOG      Vanessa    200
MSFT     shanelle    150

In [92]:
byComp.min()

        Person  Sales
Company
AAPL       Amy    234
GOOG      Mark    130
MSFT      Drew    120

In [94]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min    25%    50%    75%    max
Company
AAPL      2.0  592.0  506.288455  234.0  413.0  592.0  771.0  950.0
GOOG      2.0  165.0   49.497475  130.0  147.5  165.0  182.5  200.0
MSFT      2.0  135.0   21.213203  120.0  127.5  135.0  142.5  150.0

In [95]:
df.groupby('Company').describe().transpose()

Company            AAPL        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   592.000000  165.000000  135.000000
      std    506.288455   49.497475   21.213203
      min    234.000000  130.000000  120.000000
      25%    413.000000  147.500000  127.500000
      50%    592.000000  165.000000  135.000000
      75%    771.000000  182.500000  142.500000
      max    950.000000  200.000000  150.000000

In [99]:
df.groupby('Company').describe().transpose()['GOOG']

Sales  count      2.000000
       mean     165.000000
       std       49.497475
       min      130.000000
       25%      147.500000
       50%      165.000000
       75%      182.500000
       max      200.000000
Name: GOOG, dtype: float64

# Merging, joining, and Concatenation

In [100]:
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']},
    index = [0, 1, 2, 3]
)

In [101]:
df2 = pd.DataFrame({
    'A': ['A4', 'A5', 'A6', 'A7'],
    'B': ['B4', 'B5', 'B6', 'B7'],
    'C': ['C4', 'C5', 'C6', 'C7'],
    'D': ['D4', 'D5', 'D6', 'D7']},
    index = [4, 5, 6, 7]
)

In [102]:
df3 = pd.DataFrame({
    'A': ['A8', 'A9', 'A10', 'A11'],
    'B': ['B8', 'B9', 'B10', 'B11'],
    'C': ['C8', 'C9', 'C10', 'C11'],
    'D': ['D8', 'D9', 'D10', 'D11']},
    index = [8, 9, 10, 11]
)

In [103]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [104]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [105]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [106]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [107]:
pd.concat([df1, df2, df3], axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [110]:
pd.concat([df1, df2, df3], axis = 1).fillna(value = '-')

     A   B   C   D   A   B   C   D    A    B    C    D
0   A0  B0  C0  D0   -   -   -   -    -    -    -    -
1   A1  B1  C1  D1   -   -   -   -    -    -    -    -
2   A2  B2  C2  D2   -   -   -   -    -    -    -    -
3   A3  B3  C3  D3   -   -   -   -    -    -    -    -
4    -   -   -   -  A4  B4  C4  D4    -    -    -    -
5    -   -   -   -  A5  B5  C5  D5    -    -    -    -
6    -   -   -   -  A6  B6  C6  D6    -    -    -    -
7    -   -   -   -  A7  B7  C7  D7    -    -    -    -
8    -   -   -   -   -   -   -   -   A8   B8   C8   D8
9    -   -   -   -   -   -   -   -   A9   B9   C9   D9
10   -   -   -   -   -   -   -   -  A10  B10  C10  D10
11   -   -   -   -   -   -   -   -  A11  B11  C11  D11

In [111]:
left = pd.DataFrame({
    'Key': ['K0', 'K1', 'K2', 'K3'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3']
})

right = pd.DataFrame({
    'Key': ['K0', 'K1', 'K2', 'K3'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']
})

In [112]:
left

  Key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [113]:
right

  Key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [114]:
pd.merge(left, right, how='inner', on='Key')

  Key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [128]:
le = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2']},
    index=['K0', 'K1', 'K2']
)

ri = pd.DataFrame({
    'C': ['C0', 'C1', 'C2'],
    'D': ['D0', 'D1', 'D2']},
    index=['K0', 'K1', 'K2']
)

In [129]:
le.join(ri)

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2

In [130]:
le.join(ri, how='outer')

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2

# Operations

In [131]:
df = pd.DataFrame({
    'col1':[1,2,3,4],
    'col2':[444,555,666,444],
    'col3':['abc','def','ghi','xyz']
})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [132]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [133]:
len(df['col2'].unique()) # similar to In [134]

3

In [134]:
df['col2'].nunique() # Pandas operation

3

In [136]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [137]:
df[df['col1'] > 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [138]:
df['col1'] > 2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [140]:
df[(df['col1'] > 2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

In [141]:
def times2(x):
    return x*2

In [143]:
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [142]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [144]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [145]:
df.drop('col1', axis = 1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [146]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [147]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [149]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [150]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [151]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [152]:
data = {
    'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
    'B': ['one', 'one', 'two', 'two', 'one', 'one'],
    'C': ['x', 'y', 'x', 'y', 'x', 'y'],
    'D': [1, 3, 2, 5, 4, 1]
}

df = pd.DataFrame(data)

In [153]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [154]:
df.pivot_table(values='D', index=['A','B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data Input and Output
- CSV
- Excel
- HTML
- SQL

In [155]:
pwd

"D:\\O's Extra's\\DS\\Projects\\Python\\ADVANCE\\Libraries"

In [157]:
df = pd.read_csv('example.csv')

In [158]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [168]:
df.to_csv('my_output', index=False)

In [169]:
pd.read_csv('my_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [172]:
pd.read_excel('Excel_Sample.xlsx', sheet_name=0)

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [174]:
df.to_excel('Excel_Sample2.xlsx', sheet_name='newsheet')

In [183]:
data = pd.read_html('https://github.com/BrambleXu/pydata-notebook/blob/master/examples/fdic_failed_bank_list.html')

In [184]:
type(data)

list

In [185]:
data[0]

       0                                                  1
0    NaN                                    <!DOCTYPE html>
1    NaN  <!-- saved from url=(0057)https://www.fdic.gov...
2    NaN  <html lang="en-US"><!-- Content language is Am...
3    NaN              <title>FDIC: Failed Bank List</title>
4    NaN                                 <!-- Meta Tags -->
...   ..                                                ...
4988 NaN                                                NaN
4989 NaN                                                NaN
4990 NaN                                                NaN
4991 NaN                                                NaN
4992 NaN                                     </body></html>

[4993 rows x 2 columns]

In [186]:
from sqlalchemy import create_engine

engine = create_engine('sqlite:///:memory:')

In [187]:
df.to_sql('my_table', engine)

In [188]:
sqldf = pd.read_sql('my_table', con=engine)

In [189]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15